In [1]:
import pandas as pd
import numpy as np

In [6]:
data1 = { "Name" : ['Ahmed' , 'Fatima' , 'Ali'] , 'Age' : [28 , 32 , 24]}

data2 = { "Name" : ['Sara' , 'Usman' , 'Aisha'] , 'Age' : [29 , 35 , 27]}

data3 = { "City" : ['Karachi' , 'Lahore' , 'Islamabad'] , 'Province' : ['Sindh' , 'Punjab' , "Islamabad" ]}

df1 = pd.DataFrame(data1)

df2 = pd.DataFrame(data2)

df3 = pd.DataFrame(data3)

     Name  Age       City   Province
0   Ahmed   28    Karachi      Sindh
1  Fatima   32     Lahore     Punjab
2     Ali   24  Islamabad  Islamabad

- ## **Row wise concatenation**

In [7]:
concatenated_rows = pd.concat([df1 , df2]) # axis is by default 0 here.
concatenated_rows

     Name  Age
0   Ahmed   28
1  Fatima   32
2     Ali   24
0    Sara   29
1   Usman   35
2   Aisha   27

- ## **Column wise concatenation**

In [8]:
concatenated_columns = pd.concat([df1 , df3] , axis= 1)
concatenated_columns

     Name  Age       City   Province
0   Ahmed   28    Karachi      Sindh
1  Fatima   32     Lahore     Punjab
2     Ali   24  Islamabad  Islamabad